[
  "obsidian-advanced-slides",
  "table-editor-obsidian",
  "obsidian-full-calendar",
  "obsidian-excalidraw-plugin",
  "omnisearch",
  "scholar",
  "syncthing-integration",
  "text-extractor",
  "editing-toolbar",
  "copilot",
  "obsidian-pandoc",
  "obsidian-mind-map",
  "table-extended",
  "obsidian-style-settings",
  "nl-syntax-highlighting",
  "obsidian-git"
]