#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>



/*
Написать программу вычисления максимального числа из введенных пользователем в виде одной строки.  
Использовать для этого макрос (без функции), на вход которому подается массив чисел и их количество.
*/

int main(){
	char st[1000];

	printf("Введите строку чисел через пробел:\n");
	scanf("%s", st);





	return 0;
}